Tekla.Structures.Model.RebarGroup
The RebarGroup class represents a group of reinforcing bars.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Beam Beam = new Beam(new Point(5000, 8000, 0), new Point(6000, 8000, 0));
Beam.Profile.ProfileString = "250*250";
Beam.Material.MaterialString = "K40-1";
Beam.Finish = "PAINT";
Beam.Insert();
double MinimumX = Beam.GetSolid().MinimumPoint.X;
double MinimumY = Beam.GetSolid().MinimumPoint.Y;
double MinimumZ = Beam.GetSolid().MinimumPoint.Z;
double MaximumX = Beam.GetSolid().MaximumPoint.X;
double MaximumY = Beam.GetSolid().MaximumPoint.Y;
double MaximumZ = Beam.GetSolid().MaximumPoint.Z;
Polygon Polygon = new Polygon();
Polygon.Points.Add(new Point(MinimumX, MaximumY, MinimumZ));
Polygon.Points.Add(new Point(MinimumX, MinimumY, MinimumZ));
Polygon.Points.Add(new Point(MinimumX, MinimumY, MaximumZ));
Polygon.Points.Add(new Point(MinimumX, MaximumY, MaximumZ));
Polygon Polygon2 = new Polygon();
Polygon2.Points.Add(new Point(MaximumX, MaximumY, MinimumZ));
Polygon2.Points.Add(new Point(MaximumX, MinimumY, MinimumZ));
Polygon2.Points.Add(new Point(MaximumX, MinimumY, MaximumZ));
Polygon2.Points.Add(new Point(MaximumX, MaximumY, MaximumZ));
RebarGroup RebarGroup = new RebarGroup();
RebarGroup.Polygons.Add(Polygon);
RebarGroup.Polygons.Add(Polygon2);
RebarGroup.RadiusValues.Add(40.0);
RebarGroup.SpacingType = RebarGroup.RebarGroupSpacingTypeEnum.SPACING_TYPE_TARGET_SPACE;
RebarGroup.Spacings.Add(30.0);
RebarGroup.ExcludeType = RebarGroup.ExcludeTypeEnum.EXCLUDE_TYPE_BOTH;
RebarGroup.Father = Beam;
RebarGroup.Name = "RebarGroup";
RebarGroup.Class = 3;
RebarGroup.Size = "12";
RebarGroup.NumberingSeries.StartNumber = 0;
RebarGroup.NumberingSeries.Prefix = "Group";
RebarGroup.Grade = "A500HW";
RebarGroup.StartHook.Shape = RebarHookData.RebarHookShapeEnum.CUSTOM_HOOK;
RebarGroup.StartHook.Angle = -90;
RebarGroup.StartHook.Length = 3;
RebarGroup.StartHook.Radius = 20;
RebarGroup.EndHook.Shape = RebarHookData.RebarHookShapeEnum.CUSTOM_HOOK;
RebarGroup.EndHook.Angle = -90;
RebarGroup.EndHook.Length = 3;
RebarGroup.EndHook.Radius = 20;
RebarGroup.OnPlaneOffsets.Add(25.0);
RebarGroup.OnPlaneOffsets.Add(10.0);
RebarGroup.OnPlaneOffsets.Add(25.0);
RebarGroup.StartPointOffsetType = Reinforcement.RebarOffsetTypeEnum.OFFSET_TYPE_COVER_THICKNESS;
RebarGroup.StartPointOffsetValue = 20;
RebarGroup.EndPointOffsetType = Reinforcement.RebarOffsetTypeEnum.OFFSET_TYPE_COVER_THICKNESS;
RebarGroup.EndPointOffsetValue = 60;
RebarGroup.FromPlaneOffset = 40;
RebarGroup.Insert();
RebarGroup.Name = "Modified Group 1";
RebarGroup.Modify();
}
}

Tekla.Structures.Model.RebarGroup.Polygons
An array list of polygons to define the reinforcing bar group shape.
Use 1 polygon when defining non-tapered or spiral rebar groups.
Use 2 to 99 polygons when defining tapered rebar groups.
Each polygon must have an equal number of points.

Tekla.Structures.Model.RebarGroup.StirrupType
The type of the stirrup.
The options are:
STIRRUP_TYPE_POLYGONAL
STIRRUP_TYPE_SPIRAL
STIRRUP_TYPE_TAPERED_CURVED

Tekla.Structures.Model.RebarGroup.#ctor
Initializes a new rebar group instance with empty attributes.

Tekla.Structures.Model.RebarGroup.Insert
Inserts the rebar group into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.RebarGroup.Select
Selects a rebar group from the model database. The reinforcement identifier must be set.
Returns: True on success.

Tekla.Structures.Model.RebarGroup.Modify
Modifies the existing rebar group in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.RebarGroup.Delete
Deletes the rebar group instance with the given identifier from the model database.
Returns: True on success.